[
    {
        "type": "message",
        "user": "U061A3E0G",
        "text": "A little visualization, accountability, and behavior design: <http:\/\/qz.com\/435425\/coloring-in-this-picture-helped-me-erase-26000-in-debt\/>",
        "attachments": [
            {
                "service_name": "Quartz",
                "service_url": "http:\/\/qz.com",
                "title": "Coloring in this picture helped me erase $26,000 in debt",
                "title_link": "http:\/\/qz.com\/435425\/coloring-in-this-picture-helped-me-erase-26000-in-debt\/",
                "author_name": "Commentary",
                "author_link": "https:\/\/qz.com\/author\/commentaryqz\/",
                "thumb_url": "https:\/\/i2.wp.com\/qzprod.files.wordpress.com\/2015\/06\/quartz_inprogresswithpens1.jpg?fit=200%2C150",
                "thumb_width": 200,
                "thumb_height": 112,
                "text": "I take great joy in telling people I paid off my credit cards. All five of them. And It only took half the time I thought it would. It feels really, really good after dragging that debt around for most of my adult life. And to be extra honest—it’s also quite fun to share how I did it.\nIt involved a Sharpie, a random piece of framed canvas, and smelly pens (yes, these sweet scented little loves).\nHere’s how it began. In April of 2014 my tax guy, Steve, had a very kind, yet firm talk with me about how I needed to deal with my debt. I’d been in denial for some time about paying it off in earnest. It just seemed overwhelming so I kept putting it off—making minimum payments and pretending like it would disappear.\n Unicorns saddled with cash were not coming to fix my debt problem. I needed a new approach. Unfortunately, unicorns saddled with cash were not coming. I needed a new approach. I also had this piece of framed canvas sitting around (as ridiculous as that sounds) and wanted to do something with it. One night, as I surrendered to the fact that it was time to be a grown woman, inspiration struck.\nI wish I could say that this was my original idea. I assure you it’s not. I grew up watching my mom employ the same strategy when she was working toward her sales incentive trips. Her company would provide a simple drawing that represented the sales goals and she would color in the corresponding shapes as she made her numbers. It hung up next to her desk where she could see it often. So could I.\nMy mom won nearly every single trip. This was an annual win for our entire family.\nDecades later, Steve’s pep-talk echoing in my head, I decided that it just might work for me too. So I grabbed a Sharpie and started drawing the same doodle pattern of swirls that I’ve been drawing for years in notebooks while on conference calls. I wasn’t paying too much attention to how it looked, what shape it ended up being, or how many swirls were in it. I eventually got tired and went to bed without finishing it.\nI never finished it, actually. I meant to have the swirls go all the way to the edges. But the next day a lovely 17-year old assistant  I committed to coloring in a swirl each $100 increment I paid toward my credit cards. came over, looked at the canvas and asked me about it. I told her my intention, and she told me it was really cool. This meant a lot coming from her, because she’s really cool. That’s all the validation I needed to share that sucker on Facebook. But first, I wanted to color in some of the swirls.\nI chose for each swirl to represent $100, because it was easy to count. I committed to coloring in a swirl each $100 increment I paid toward my credit cards. It looked like an awfully big canvas, and I honestly didn’t know how many swirls were on it, but it seemed good enough. I figured I could always add more if I needed them.\nI had some money that I’d been very proudly saving in an “emergency fund” and decided it was time to take a chunk of that and pay down my credit card with the highest APR. It stung a little. I had really enjoyed seeing the savings grow in my account. In fact I had felt so responsible, I almost forgot about the mountain of debt on my credit cards.\nSo I pulled out the smelly pens and got started: One, because I wanted to finally own up to my debt and two, because I just wanted to color in the swirls. And three, so I could eventually brag to Steve and everyone else I know.\nHere’s what went up on Facebook that day:\n(Amy Jones)\nI expected my friends to think it was cool too, but I was genuinely surprised at how enthusiastic their response was, and even more so when some friends suggested I start making more drawings and selling them. I chuckled to myself. I couldn’t possibly. I had a full-time consulting gig, was launching my online sanctuary, trying to train my puppy, and keep 38 tomato plants alive (didn’t go so well for the tomatoes, I’m afraid). Just when would I do this? And would this actually work?\nSetting my fears aside, I responded to the encouragement from my Facebook friends with, “OK, I’ll have a think about it! Which, as you all know, is such a casual understatement of how I will obsessively consider the possibilities of this.”\nAnd that is pretty much what I did. I quickly ruled out drawing them by hand on canvas. Too time intensive, not easily scalable, and tough to ship. Then I thought I’d just create the designs, scan them, and sell them as digital downloads.\nI was gently reminded by friends and yes, my mom, that most people just want the finished product—for it to be as easy as possible to get started. Right.\nMonths went by, circumstances changed, and I started to believe that I could actually make a go of it—selling my doodle drawings, which I’d started calling Creative Progress Maps, and intending the proceeds go to financially support the growth of my online sanctuary project. I didn’t realize at the time I’d one day aim even higher.\n(Amy Jones)\nAfter more months of test runs, research, and finding the right printer, I find myself here. I’ve created this site. I’ve drawn the logo by hand because I don’t have the cash at present to hire a designer to do it for me. I’ve taken courses on coding because I needed to know some how to create page layouts myself. I’ve come up with 15 designs so far and have a notebook full of more ideas. Lots more maps. And now these blog posts.\nIf it sounds like I’m a bit bewildered about the whole thing, it’s because I am. This isn’t what I thought I’d be doing. Only recently did I start believing in myself enough to take this leap—believing enough in my maps—to let go of my consulting work and do this full-time. Because despite how scared I am to stake my livelihood on people wanting to buy my maps, I keep coming back to the same thought: My map worked for me. It really, truly helped motivate me to get my debt paid off.\nColoring in those swirls month after month helped me feel like I was doing something. It helped me see that I was making progress toward my goal of zeroing out my credit cards. I joke that it’s the most expensive piece of art I own, because of how much money it represents to me. Money that has been paid off.\nHere’s the finished map. You’ll note there are swirls not colored in. That’s because I wasn’t counting when I drew this one (the original) and I’m taking it as a great sign of recovery (former perfectionist that I am) that I’ve chosen to let it be. That’s 264 swirls in color, and I am proud of every one of them.\n(Amy Jones)\nEver since I first shared my story publicly, I have been overwhelmed by the response. I had no idea I’d receive orders from humans in Australia, New Zealand, the UK, Norway, and Israel. So many have reached out to share their struggles with debt and I’m reminded that I’m not alone. We’re all just human people. It really doesn’t matter where you live or what currency you use.\nI’ve heard from those of you who wish to pay off credit cards, student loans, and debt from divorces. I’ve heard from so many who wish to shed the weight they don’t need, from writers who want to get down 1,000 words a day, from an adorable wife who is saving up for a car to surprise her husband (that’s a secret by the way).\nMy printer is working their way through over 130 orders at the moment and the first 10 have shipped this last week. I cannot wait until they start getting in the hands of other humans like me with hopes and dreams and the belief that we can grow. I want to hear all about it. I delight in your photos and stories and ideas.\nThe invitation is this: No matter what goal you have, be it financial, fitness-related, a big life event, or a desire to form healthier habits, Creative Progress Maps are now here for you to use. Yes, they are black and white drawings. But they are also tools, and hope, and your own work of art the second you color in that first swirl.\nThey stand for something that matters to you. Something great. And I cannot wait to see what you do with them.\nHopefully, you will soon. Because I’ve got back taxes to tackle next.\nA version of this piece was originally published on Map Your Progress. Follow Amy on Twitter at @mapyourprogress. We welcome your comments at <mailto:ideas@qz.com|ideas@qz.com>.",
                "fallback": "Quartz Link: Coloring in this picture helped me erase $26,000 in debt",
                "from_url": "http:\/\/qz.com\/435425\/coloring-in-this-picture-helped-me-erase-26000-in-debt\/",
                "id": 1
            }
        ],
        "ts": "1435187544.046519"
    },
    {
        "type": "message",
        "user": "U061A5N1G",
        "text": "That's cool",
        "ts": "1435188638.000002"
    },
    {
        "type": "message",
        "user": "U061A5N1G",
        "text": "I always liked coloring stuff in. Don't know if it'd be that pretty though",
        "ts": "1435188725.000003"
    }
]